# SetAttribute Method (String, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAnyHandle..::..SetAttribute Method (String, Double)
IFCAnyHandle Class See Also
---
Sets the attribute value.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetAttribute(
	string name,
	double value
)
```

Visual Basic
---
```text
Public Sub SetAttribute ( _
	name As String, _
	value As Double _
)
```

Visual C++
---
```text
public:
void SetAttribute(
	String^ name,
	double value
)
```

# ### Parameters
name
    Type: System..::..String The attribute name.
value
    Type: System..::..Double The value.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace